RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_lesense.h
#define _LESENSE_DECCTRL_PRSSEL2_PRSCH12               0x0000000CUL                              /**< Mode PRSCH12 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL2_PRSCH13               0x0000000DUL                              /**< Mode PRSCH13 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL2_PRSCH14               0x0000000EUL                              /**< Mode PRSCH14 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL2_PRSCH15               0x0000000FUL                              /**< Mode PRSCH15 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL2_PRSCH16               0x00000010UL                              /**< Mode PRSCH16 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL2_PRSCH17               0x00000011UL                              /**< Mode PRSCH17 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL2_PRSCH18               0x00000012UL                              /**< Mode PRSCH18 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL2_PRSCH19               0x00000013UL                              /**< Mode PRSCH19 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL2_PRSCH20               0x00000014UL                              /**< Mode PRSCH20 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL2_PRSCH21               0x00000015UL                              /**< Mode PRSCH21 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL2_PRSCH22               0x00000016UL                              /**< Mode PRSCH22 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL2_PRSCH23               0x00000017UL                              /**< Mode PRSCH23 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL2_DEFAULT                (_LESENSE_DECCTRL_PRSSEL2_DEFAULT << 20)  /**< Shifted mode DEFAULT for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL2_PRSCH0                 (_LESENSE_DECCTRL_PRSSEL2_PRSCH0 << 20)   /**< Shifted mode PRSCH0 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL2_PRSCH1                 (_LESENSE_DECCTRL_PRSSEL2_PRSCH1 << 20)   /**< Shifted mode PRSCH1 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL2_PRSCH2                 (_LESENSE_DECCTRL_PRSSEL2_PRSCH2 << 20)   /**< Shifted mode PRSCH2 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL2_PRSCH3                 (_LESENSE_DECCTRL_PRSSEL2_PRSCH3 << 20)   /**< Shifted mode PRSCH3 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL2_PRSCH4                 (_LESENSE_DECCTRL_PRSSEL2_PRSCH4 << 20)   /**< Shifted mode PRSCH4 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL2_PRSCH5                 (_LESENSE_DECCTRL_PRSSEL2_PRSCH5 << 20)   /**< Shifted mode PRSCH5 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL2_PRSCH6                 (_LESENSE_DECCTRL_PRSSEL2_PRSCH6 << 20)   /**< Shifted mode PRSCH6 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL2_PRSCH7                 (_LESENSE_DECCTRL_PRSSEL2_PRSCH7 << 20)   /**< Shifted mode PRSCH7 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL2_PRSCH8                 (_LESENSE_DECCTRL_PRSSEL2_PRSCH8 << 20)   /**< Shifted mode PRSCH8 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL2_PRSCH9                 (_LESENSE_DECCTRL_PRSSEL2_PRSCH9 << 20)   /**< Shifted mode PRSCH9 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL2_PRSCH10                (_LESENSE_DECCTRL_PRSSEL2_PRSCH10 << 20)  /**< Shifted mode PRSCH10 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL2_PRSCH11                (_LESENSE_DECCTRL_PRSSEL2_PRSCH11 << 20)  /**< Shifted mode PRSCH11 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL2_PRSCH12                (_LESENSE_DECCTRL_PRSSEL2_PRSCH12 << 20)  /**< Shifted mode PRSCH12 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL2_PRSCH13                (_LESENSE_DECCTRL_PRSSEL2_PRSCH13 << 20)  /**< Shifted mode PRSCH13 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL2_PRSCH14                (_LESENSE_DECCTRL_PRSSEL2_PRSCH14 << 20)  /**< Shifted mode PRSCH14 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL2_PRSCH15                (_LESENSE_DECCTRL_PRSSEL2_PRSCH15 << 20)  /**< Shifted mode PRSCH15 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL2_PRSCH16                (_LESENSE_DECCTRL_PRSSEL2_PRSCH16 << 20)  /**< Shifted mode PRSCH16 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL2_PRSCH17                (_LESENSE_DECCTRL_PRSSEL2_PRSCH17 << 20)  /**< Shifted mode PRSCH17 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL2_PRSCH18                (_LESENSE_DECCTRL_PRSSEL2_PRSCH18 << 20)  /**< Shifted mode PRSCH18 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL2_PRSCH19                (_LESENSE_DECCTRL_PRSSEL2_PRSCH19 << 20)  /**< Shifted mode PRSCH19 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL2_PRSCH20                (_LESENSE_DECCTRL_PRSSEL2_PRSCH20 << 20)  /**< Shifted mode PRSCH20 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL2_PRSCH21                (_LESENSE_DECCTRL_PRSSEL2_PRSCH21 << 20)  /**< Shifted mode PRSCH21 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL2_PRSCH22                (_LESENSE_DECCTRL_PRSSEL2_PRSCH22 << 20)  /**< Shifted mode PRSCH22 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL2_PRSCH23                (_LESENSE_DECCTRL_PRSSEL2_PRSCH23 << 20)  /**< Shifted mode PRSCH23 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL3_SHIFT                 25                                        /**< Shift value for LESENSE_PRSSEL3 */
#define _LESENSE_DECCTRL_PRSSEL3_MASK                  0x3E000000UL                              /**< Bit mask for LESENSE_PRSSEL3 */
#define _LESENSE_DECCTRL_PRSSEL3_DEFAULT               0x00000000UL                              /**< Mode DEFAULT for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL3_PRSCH0                0x00000000UL                              /**< Mode PRSCH0 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL3_PRSCH1                0x00000001UL                              /**< Mode PRSCH1 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL3_PRSCH2                0x00000002UL                              /**< Mode PRSCH2 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL3_PRSCH3                0x00000003UL                              /**< Mode PRSCH3 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL3_PRSCH4                0x00000004UL                              /**< Mode PRSCH4 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL3_PRSCH5                0x00000005UL                              /**< Mode PRSCH5 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL3_PRSCH6                0x00000006UL                              /**< Mode PRSCH6 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL3_PRSCH7                0x00000007UL                              /**< Mode PRSCH7 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL3_PRSCH8                0x00000008UL                              /**< Mode PRSCH8 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL3_PRSCH9                0x00000009UL                              /**< Mode PRSCH9 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL3_PRSCH10               0x0000000AUL                              /**< Mode PRSCH10 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL3_PRSCH11               0x0000000BUL                              /**< Mode PRSCH11 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL3_PRSCH12               0x0000000CUL                              /**< Mode PRSCH12 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL3_PRSCH13               0x0000000DUL                              /**< Mode PRSCH13 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL3_PRSCH14               0x0000000EUL                              /**< Mode PRSCH14 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL3_PRSCH15               0x0000000FUL                              /**< Mode PRSCH15 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL3_PRSCH16               0x00000010UL                              /**< Mode PRSCH16 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL3_PRSCH17               0x00000011UL                              /**< Mode PRSCH17 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL3_PRSCH18               0x00000012UL                              /**< Mode PRSCH18 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL3_PRSCH19               0x00000013UL                              /**< Mode PRSCH19 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL3_PRSCH20               0x00000014UL                              /**< Mode PRSCH20 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL3_PRSCH21               0x00000015UL                              /**< Mode PRSCH21 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL3_PRSCH22               0x00000016UL                              /**< Mode PRSCH22 for LESENSE_DECCTRL */
#define _LESENSE_DECCTRL_PRSSEL3_PRSCH23               0x00000017UL                              /**< Mode PRSCH23 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL3_DEFAULT                (_LESENSE_DECCTRL_PRSSEL3_DEFAULT << 25)  /**< Shifted mode DEFAULT for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL3_PRSCH0                 (_LESENSE_DECCTRL_PRSSEL3_PRSCH0 << 25)   /**< Shifted mode PRSCH0 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL3_PRSCH1                 (_LESENSE_DECCTRL_PRSSEL3_PRSCH1 << 25)   /**< Shifted mode PRSCH1 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL3_PRSCH2                 (_LESENSE_DECCTRL_PRSSEL3_PRSCH2 << 25)   /**< Shifted mode PRSCH2 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL3_PRSCH3                 (_LESENSE_DECCTRL_PRSSEL3_PRSCH3 << 25)   /**< Shifted mode PRSCH3 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL3_PRSCH4                 (_LESENSE_DECCTRL_PRSSEL3_PRSCH4 << 25)   /**< Shifted mode PRSCH4 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL3_PRSCH5                 (_LESENSE_DECCTRL_PRSSEL3_PRSCH5 << 25)   /**< Shifted mode PRSCH5 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL3_PRSCH6                 (_LESENSE_DECCTRL_PRSSEL3_PRSCH6 << 25)   /**< Shifted mode PRSCH6 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL3_PRSCH7                 (_LESENSE_DECCTRL_PRSSEL3_PRSCH7 << 25)   /**< Shifted mode PRSCH7 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL3_PRSCH8                 (_LESENSE_DECCTRL_PRSSEL3_PRSCH8 << 25)   /**< Shifted mode PRSCH8 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL3_PRSCH9                 (_LESENSE_DECCTRL_PRSSEL3_PRSCH9 << 25)   /**< Shifted mode PRSCH9 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL3_PRSCH10                (_LESENSE_DECCTRL_PRSSEL3_PRSCH10 << 25)  /**< Shifted mode PRSCH10 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL3_PRSCH11                (_LESENSE_DECCTRL_PRSSEL3_PRSCH11 << 25)  /**< Shifted mode PRSCH11 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL3_PRSCH12                (_LESENSE_DECCTRL_PRSSEL3_PRSCH12 << 25)  /**< Shifted mode PRSCH12 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL3_PRSCH13                (_LESENSE_DECCTRL_PRSSEL3_PRSCH13 << 25)  /**< Shifted mode PRSCH13 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL3_PRSCH14                (_LESENSE_DECCTRL_PRSSEL3_PRSCH14 << 25)  /**< Shifted mode PRSCH14 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL3_PRSCH15                (_LESENSE_DECCTRL_PRSSEL3_PRSCH15 << 25)  /**< Shifted mode PRSCH15 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL3_PRSCH16                (_LESENSE_DECCTRL_PRSSEL3_PRSCH16 << 25)  /**< Shifted mode PRSCH16 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL3_PRSCH17                (_LESENSE_DECCTRL_PRSSEL3_PRSCH17 << 25)  /**< Shifted mode PRSCH17 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL3_PRSCH18                (_LESENSE_DECCTRL_PRSSEL3_PRSCH18 << 25)  /**< Shifted mode PRSCH18 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL3_PRSCH19                (_LESENSE_DECCTRL_PRSSEL3_PRSCH19 << 25)  /**< Shifted mode PRSCH19 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL3_PRSCH20                (_LESENSE_DECCTRL_PRSSEL3_PRSCH20 << 25)  /**< Shifted mode PRSCH20 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL3_PRSCH21                (_LESENSE_DECCTRL_PRSSEL3_PRSCH21 << 25)  /**< Shifted mode PRSCH21 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL3_PRSCH22                (_LESENSE_DECCTRL_PRSSEL3_PRSCH22 << 25)  /**< Shifted mode PRSCH22 for LESENSE_DECCTRL */
#define LESENSE_DECCTRL_PRSSEL3_PRSCH23                (_LESENSE_DECCTRL_PRSSEL3_PRSCH23 << 25)  /**< Shifted mode PRSCH23 for LESENSE_DECCTRL */

/* Bit fields for LESENSE BIASCTRL */
#define _LESENSE_BIASCTRL_RESETVALUE                   0x00000000UL                                /**< Default value for LESENSE_BIASCTRL */
#define _LESENSE_BIASCTRL_MASK                         0x00000003UL                                /**< Mask for LESENSE_BIASCTRL */
#define _LESENSE_BIASCTRL_BIASMODE_SHIFT               0                                           /**< Shift value for LESENSE_BIASMODE */
#define _LESENSE_BIASCTRL_BIASMODE_MASK                0x3UL                                       /**< Bit mask for LESENSE_BIASMODE */
#define _LESENSE_BIASCTRL_BIASMODE_DEFAULT             0x00000000UL                                /**< Mode DEFAULT for LESENSE_BIASCTRL */
#define _LESENSE_BIASCTRL_BIASMODE_DONTTOUCH           0x00000000UL                                /**< Mode DONTTOUCH for LESENSE_BIASCTRL */
#define _LESENSE_BIASCTRL_BIASMODE_DUTYCYCLE           0x00000001UL                                /**< Mode DUTYCYCLE for LESENSE_BIASCTRL */
#define _LESENSE_BIASCTRL_BIASMODE_HIGHACC             0x00000002UL                                /**< Mode HIGHACC for LESENSE_BIASCTRL */
#define LESENSE_BIASCTRL_BIASMODE_DEFAULT              (_LESENSE_BIASCTRL_BIASMODE_DEFAULT << 0)   /**< Shifted mode DEFAULT for LESENSE_BIASCTRL */
#define LESENSE_BIASCTRL_BIASMODE_DONTTOUCH            (_LESENSE_BIASCTRL_BIASMODE_DONTTOUCH << 0) /**< Shifted mode DONTTOUCH for LESENSE_BIASCTRL */
#define LESENSE_BIASCTRL_BIASMODE_DUTYCYCLE            (_LESENSE_BIASCTRL_BIASMODE_DUTYCYCLE << 0) /**< Shifted mode DUTYCYCLE for LESENSE_BIASCTRL */
#define LESENSE_BIASCTRL_BIASMODE_HIGHACC              (_LESENSE_BIASCTRL_BIASMODE_HIGHACC << 0)   /**< Shifted mode HIGHACC for LESENSE_BIASCTRL */

